#### What is a panda series?
A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.

#### Selecting the data from the DataFrame:
Loc and iloc are two functions in Pandas that are used to slice a data set in a Pandas DataFrame. The function . loc is typically used for label indexing and can access multiple columns, while . iloc is used for integer indexing.

1. loc --> Row and Column labels
2. iloc --> Row and Column index

#### Retrieving the information of DataFrame

#### Viewing data from DataFrame:
1. head()
2. tail()
3. sample()

#### Renaming the column headers

#### Renaming the Row labels

#### Sample Dictionary
```
 exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
```

#### Changing the row index:
1. set_index()
2. reset_index()

#### Removing columns and rows

In [1]:
import pandas as pd
import numpy as np

In [4]:
#Creating a DF ==> 1. using a simple dictionary
dict1 = {"name":["preeti","vamshi","vijay"],"location":["adilabad","Amalapuram","hyd"]}
dict1

{'name': ['preeti', 'vamshi', 'vijay'],
 'location': ['adilabad', 'Amalapuram', 'hyd']}

In [5]:
df1 = pd.DataFrame(dict1)
df1

     name    location
0  preeti    adilabad
1  vamshi  Amalapuram
2   vijay         hyd

In [6]:
#using 2 dictionaries
dict1 = {"a":1,"b":2,"c":3,"d":4,"e":5}
dict2 = {"a":5,"b":6,"c":7,"d":8,"e":9}
data = {"First":dict1,"second":dict2}
df2 = pd.DataFrame(data)
df2

   First  second
a      1       5
b      2       6
c      3       7
d      4       8
e      5       9

In [7]:
#using series
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([12.2,34.5,122.5,1234.6,9.0])
s3 = pd.Series(['a','b','c','d','e'])
data = {"First":s1,"Second":s2,"Third":s3}
df3 = pd.DataFrame(data)
df3

   First  Second Third
0      1    12.2     a
1      2    34.5     b
2      3   122.5     c
3      4  1234.6     d
4      5     9.0     e

### selecting data from DF
1. loc ==> using labels
2. iloc ==> using indexes

In [8]:
df3

   First  Second Third
0      1    12.2     a
1      2    34.5     b
2      3   122.5     c
3      4  1234.6     d
4      5     9.0     e

In [10]:
df3["First"]

0    1
1    2
2    3
3    4
4    5
Name: First, dtype: int64

In [12]:
df3[["First","Third"]]

   First Third
0      1     a
1      2     b
2      3     c
3      4     d
4      5     e

In [13]:
#loc
df3.loc[:,"First"]

0    1
1    2
2    3
3    4
4    5
Name: First, dtype: int64

In [14]:
df3.loc[0:2,"First"]

0    1
1    2
2    3
Name: First, dtype: int64

In [15]:
df3.iloc[:,0]

0    1
1    2
2    3
3    4
4    5
Name: First, dtype: int64

In [17]:
df3.iloc[0,0:3]

First        1
Second    12.2
Third        a
Name: 0, dtype: object

In [18]:
df3.iloc[0:2,0:3]

   First  Second Third
0      1    12.2     a
1      2    34.5     b

In [20]:
df3.iloc[0,0:3]

First        1
Second    12.2
Third        a
Name: 0, dtype: object

### Retriving info from DF

In [21]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   First   5 non-null      int64
 1   Second  5 non-null      float64
 2   Third   5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [22]:
df3.shape

(5, 3)

In [23]:
#columns
df3.columns

Index(['First', 'Second', 'Third'], dtype='object')

In [24]:
#Rows
df3.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
df3.describe()

          First       Second
count  5.000000     5.000000
mean   3.000000   282.560000
std    1.581139   534.196296
min    1.000000     9.000000
25%    2.000000    12.200000
50%    3.000000    34.500000
75%    4.000000   122.500000
max    5.000000  1234.600000

### Viewing data from DF
1. head() ==> First 5 rows by default
2. tail() ==> last 5 rows by default
3. sample() ==> returns random ro from the DF

In [27]:
s1 = pd.Series([1,2,3,4,5,6,7,8,9,10])
s2 = pd.Series([12.2,34.5,122.5,1234.6,9.0,12.2,34.6,45.67,78.3,100.4])
s3 = pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data = {"First":s1,"Second":s2,"Third":s3}
df3 = pd.DataFrame(data)
df3

   First   Second Third
0      1    12.20     a
1      2    34.50     b
2      3   122.50     c
3      4  1234.60     d
4      5     9.00     e
5      6    12.20     f
6      7    34.60     g
7      8    45.67     h
8      9    78.30     i
9     10   100.40     j

In [28]:
df3.head()

   First  Second Third
0      1    12.2     a
1      2    34.5     b
2      3   122.5     c
3      4  1234.6     d
4      5     9.0     e

In [29]:
df3.head(2)

   First  Second Third
0      1    12.2     a
1      2    34.5     b

In [31]:
df3.tail()

   First  Second Third
5      6   12.20     f
6      7   34.60     g
7      8   45.67     h
8      9   78.30     i
9     10  100.40     j

In [32]:
df3.tail(3)

   First  Second Third
7      8   45.67     h
8      9   78.30     i
9     10  100.40     j

In [41]:
df3.sample()

   First  Second Third
4      5     9.0     e

In [42]:
df3.sample(3)

   First  Second Third
7      8   45.67     h
4      5    9.00     e
2      3  122.50     c

### Renaming column headers

In [43]:
df3.columns

Index(['First', 'Second', 'Third'], dtype='object')

In [47]:
df3.rename(columns= {"First":"col-1","Second":"col-2","Third":"col-3"},inplace=True)

In [48]:
df3

   col-1    col-2 col-3
0      1    12.20     a
1      2    34.50     b
2      3   122.50     c
3      4  1234.60     d
4      5     9.00     e
5      6    12.20     f
6      7    34.60     g
7      8    45.67     h
8      9    78.30     i
9     10   100.40     j